{
  "counties": [
    {
      "id": "001",
      "name": "Mombasa",
      "fun_fact": "Home to Fort Jesus, a UNESCO World Heritage Site. Mombasa is also known for its rich Swahili culture, vibrant nightlife, and delicious coastal cuisine such as biryani and mahamri.",
      "main_resource": "Tourism and Port Services - The Port of Mombasa is the largest and busiest seaport in East Africa, serving as a key gateway for trade in the region.",
      "tourist_attraction": "Fort Jesus - Built by the Portuguese in the 16th century, Fort Jesus is an iconic historical site with stunning views of the Indian Ocean and a deep history of colonization and resistance.",
      "imgUrl": "https://images.pexels.com/photos/27965328/pexels-photo-27965328/free-photo-of-a-group-of-people-playing-volleyball-on-a-beach.jpeg?auto=compress&cs=tinysrgb&w=600",
      "comments": []
    },
    {
      "id": "002",
      "name": "Kwale",
      "fun_fact": "Famous for Diani Beach. Kwale is also home to the Shimba Hills National Reserve, which hosts the rare sable antelope and breathtaking waterfalls.",
      "main_resource": "Tourism and Mining - Besides beautiful beaches, Kwale has rich mineral deposits, including titanium, which is mined at the Base Titanium company.",
      "tourist_attraction": "Diani Beach - One of the most beautiful beaches in the world, Diani Beach is known for its crystal-clear waters, white sandy shores, and vibrant marine life, making it a haven for water sports enthusiasts.",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Diani_beach_kwale_county.jpg/960px-Diani_beach_kwale_county.jpg?20220724113337",
      "comments": []
    },
    {
      "id": "003",
      "name": "Kilifi",
      "fun_fact": "Has rich Swahili heritage. Kilifi is known for its breathtaking beaches, ancient ruins, and the vibrant Kilifi New Year Festival, a popular cultural and music event.",
      "main_resource": "Tourism and Agriculture - Coconut and cashew nut farming are major agricultural activities in Kilifi, alongside its booming hospitality industry.",
      "tourist_attraction": "Gede Ruins - An ancient Swahili town abandoned in the 17th century, the Gede Ruins provide a glimpse into the history of the Swahili people with well-preserved structures and artifacts.",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/A_village_in_a_palm_forest._Kilifi_District_-_panoramio.jpg/960px-A_village_in_a_palm_forest._Kilifi_District_-_panoramio.jpg?20161110201910",
      "comments": []
    },
    {
      "id": "004",
      "name": "Tana River",
      "fun_fact": "Named after Kenya’s longest river. The Tana River supports diverse wildlife, including hippos, crocodiles, and rare primates such as the Tana River red colobus and mangabey monkeys.",
      "main_resource": "Livestock and Farming - The region is known for cattle herding, irrigated farming, and fish farming along the river basin.",
      "tourist_attraction": "Tana River Primate Reserve - A sanctuary established to protect the endangered primates, this reserve offers a unique ecotourism experience with riverine forests and an abundance of birdlife.",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Tana_River_County%2C_Kenya_-_panoramio_%286%29.jpg/960px-Tana_River_County%2C_Kenya_-_panoramio_%286%29.jpg?20170630124137",
      "comments": []
    }
  ],
  "reviews": []
}
